#include <stdio.h>
#include <stdlib.h>
//位“反”，位“与”，位“或”和位“亦或”运算符不关心操作数的符号，
//只是操作数所在的字节0，1序列进行比对，
//符号位会被当成普通的0或1进行处理
void main()
{
	unsigned char ch1 = 4;//0000 0100
	char ch2 = -3;	//-3原码1000 0011
					//发码：1111 1100
					//补码：1111 1101

	char chor = ch1 | ch2;
	//0000 0100	4
	//1111 1101	-3
	//1111 1101 -3
	char chand = ch1 & ch2;
	//0000 0100 4
	//1111 1101 -3
	//0000 0100  4
	char cno = ~ch2;
	//1111 1101  -3
	//0000 0010 2
	char ch = ch1^ch2;
	//0000 0100  4
	//1111 1101  -3
	//1111 1001  负数补码
	//1111 1000	 负数的反码
	//1000 0111 负数的原码-7
	printf("%d,%d,%d,%d\n", chor, chand, cno, ch);
	system("pause");
}